{
	"name": "Aaron Ciaghi",
	"title": "Software Engineer",
	"short_bio": "Full-stack software engineer at NEW WORK SE (Xing) in sunny Barcelona with an academic background in computer science. My primary weapon of choice is Ruby on Rails but I also like venturing into front-end land with React. I'm currently working on re-building the Communities product of Xing, the leading professional social network for the DACH region. Before moving to Barcelona I worked 8 years, first as a PhD student and later as a researcher, at Fondazione Bruno Kessler in Trento (Italy) where I was the main developer of BringTheFood, a web application to support the Italian Food Bank and other organizations in managing food donations.",
	"technologies": {
		"backend": "Ruby, Ruby on Rails, GraphQL",
		"frontend": "JavaScript, TypeScript, React",
		"devops": "Docker, Kubernetes",
		"testing": "RSpec, Cucumber, React Testing Library, Jest",
		"project management": "JIRA, Redmine"
	},

	"social_portals": [
		{"title": "Github", "baseurl": "https://github.com", "url": "aaronsama" },
		{"title": "LinkedIn", "baseurl": "https://it.linkedin.com/in", "url": "aaron.ciaghi" },
		{"title": "Twitter", "baseurl": "http://twitter.com", "url": "a2ronsama" }
	],

	"education": [
		{
			"date": "2010 - 2014",
			"description": "University of Trento - PhD in Information and Communication Technologies"
		},
		{
			"date": "2007 - 2010",
			"description": "University of Trento and Georgia Institute of Technology - MS Degree in Computer Science (dual degree)"
		},
		{
			"date": "2004 - 2007",
			"description": "University of Trento - BS Degree in Computer Science"
		}
	],

	"projects": [
		{
			"title": "BringTheFood Ristorazione",
			"description": "Web application for charities and canteens to track food waste and donate the daily surplus. Contributed to doubling the donations received from canteens by the local food bank.",
			"url": "https://ristorazione.bringfood.org",
			"technologies": ["Ruby on Rails", "React", "Stimulus.js", "Webpack"]
		},
		{
			"title": "BringTheFood",
			"description": "Web application and API for charities and donors of food surplus.",
			"url": "https://www.bringfood.org/",
			"technologies": ["Ruby on Rails", "jQuery"]
		},
		{
			"title": "Commonfare Story Builder",
			"description": "React component for the Commonfare platform to write articles in multiple languages.",
			"url": "https://www.commonfare.net",
			"technologies": ["React"]
		},
		{
			"title": "Sea for All",
			"description": "Boat sharing web application. (side project)",
			"url": "https://www.seaforall.com",
			"technologies": ["Ruby on Rails", "jQuery"]
		},
		{
			"title": "SAMo - Social Accountability for Mozambique",
			"description": "Web application and API to help citizens support Governments in assessing the current status of facilities in Mozambique's rural areas.",
			"url": "http://ict4sa.org/samo",
			"technologies": ["Ruby on Rails"]
		}
	],

	"job_history": [
		{
			"employer": "New Work SE (Xing)",
			"date": "2019 - present",
			"role": "Senior Software Engineer (Full-stack)",
			"description": "Maintaining the legacy Communities product and building its new incarnation from the ground up for Xing, the leading professional social network in the DACH region serving 19M+ users. Primarily working with the Ruby on Rails backend and React frontend of the Communities products, integrating them with the rest of the Xing platform, throwing GraphQL, Kafka, and occasionally even Scala into the mix."
		},
		{
			"employer": "Fondazione Bruno Kessler - ICT Research Centre",
			"date": "2014 - 2018",
			"role": "Researcher",
      "description": "Managed and actively involved in software projects for social good, writing of grant proposals, research and development of food waste reduction applications. Organized and conducted trainings in Mozambique and South Africa on software development using Ruby on Rails. Participated to the organization of 10 hackathons with a focus on social impact and ICT4D. Supervised students, junior developers, BS and MS computer science theses."
		},
		{
			"employer": "Horecapp s.r.l.s.",
			"date": "2017",
			"role": "Software Engineer",
			"description": "Developed a progressive web application for beverage wholesalers to receive orders directly from their clients. Responsibilities included leading the development process using Agile methods, supporting clients in the transition and business development."
		},
		{
			"employer": "Belka s.r.l.",
			"date": "2015",
			"role": "Consulting Developer",
			"description": "Bootstrapped the development of a mobile application for peer-to-peer delivery using Ionic, Cordova and AngularJS. This included the introduction of coding standards and best practices."
		}
	],

	"teaching": [
		{
			"date": "2014 - 2017",
			"institution": "Fort Hare University, ECITI Business Incubator, Propella Business Incubator, Seda Nelson Mandela Bay ICT Incubator",
			"course": "Ruby on Rails Development Workshop"
		},
		{
			"date": "2016",
			"institution": "University of Trento - Department of Cognitive Sciences",
			"course": "Advanced Javascript and client-side web frameworks"
		},
		{
			"date": "2011 - 2013",
			"institution": "Maputo Living Lab",
			"course": "Summer School of ICTs and Summer School of Ruby on Rails"
		},
		{
			"date": "2010 - 2012",
			"institution": "University of Trento - Department of Information Engineering and Computer Science",
			"course": "eGovernment Case Studies (part of the Professional Master of Technologies for eGovernment)"
		}
	],

	"spoken_languages": [
    { "language": "Italian", "level": "native" },
    { "language": "English", "level": "fluent" },
    { "language": "Spanish", "level": "intermediate" },
    { "language": "Catalan", "level": "intermediate" },
    { "language": "Japanese", "level": "intermediate" },
    { "language": "Portuguese", "level": "basic" },
    { "language": "German", "level": "basic" },
    { "language": "Mandarin Chinese", "level": "basic" }
  ],

	"volunteering": [
		"AFS Intercultural Programs (since 2002): currently founder and president of my area's chapter.",
		"Yomoyamabanashi (2007-2018): board member in 2010-2014"
	]
}
